/*
SQLyog Ultimate v12.09 (64 bit)
MySQL - 5.6.30-log : Database - ssitcloud_device
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`ssitcloud_device` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `ssitcloud_device`;

/*Table structure for table `metadata_opercmd` */

DROP TABLE IF EXISTS `metadata_opercmd`;

CREATE TABLE `metadata_opercmd` (
  `meta_opercmd_idx` int(11) NOT NULL AUTO_INCREMENT COMMENT '自增主键',
  `opercmd_typeinfo` int(5) NOT NULL COMMENT '命令类型区分 1云端命令  2设备端',
  `operbusinesstype` varchar(100) DEFAULT NULL COMMENT '主目录例系统管理',
  `opercmd` varchar(100) DEFAULT NULL COMMENT '次目录ID号',
  `opercmd_desc` varchar(100) DEFAULT NULL COMMENT '次目录说明例：新增馆操作',
  `opercmd_url` varchar(200) DEFAULT NULL COMMENT '链接地址',
  PRIMARY KEY (`meta_opercmd_idx`)
) ENGINE=InnoDB AUTO_INCREMENT=132 DEFAULT CHARSET=utf8 COMMENT='操作指令元数据表，描述业务操作指令信息';

/*Data for the table `metadata_opercmd` */

insert  into `metadata_opercmd`(`meta_opercmd_idx`,`opercmd_typeinfo`,`operbusinesstype`,`opercmd`,`opercmd_desc`,`opercmd_url`) values (1,1,'设备注册','0101000000','注册设备',NULL),(2,1,'数据同步','0104000000','数据同步',NULL),(3,1,'监控管理','0103000000','监控管理',''),(4,1,'系统管理','0102000000','系统管理',NULL),(5,1,'数据同步','0104000000','数据同步','heartBeat,askControl,controlResult,askCfgSync,askCloudTime'),(6,1,'数据同步','0104010000','数据下载','askVersion'),(7,1,'数据同步','0104020000','数据上传','transData,uploadRunLog'),(8,1,'数据同步','0104030000','硬件配置修改','downloadCfgSync,uploadcfgSyn'),(9,1,'监控管理','0103000000','监控管理主页面','/device/deviceMain'),(10,1,'监控管理','0103010000','监控列表',NULL),(11,1,'监控管理','0103020000','监控详情',NULL),(12,1,'监控管理','0103030000','远程控制',NULL),(13,1,'监控管理','0103030100','关机',NULL),(14,1,'监控管理','0103030200','重启',NULL),(15,1,'监控管理','0103030300','下载日志',NULL),(16,1,'监控管理','0103030400','设备端锁定',NULL),(17,1,'监控管理','0103030500','取消操作',NULL),(18,1,'监控管理','0103040000','修改密码',NULL),(19,1,'系统管理','0102010000','用户管理',NULL),(20,1,'系统管理','0102020000','图书馆管理',NULL),(21,1,'系统管理','0102030000','设备管理',NULL),(22,1,'系统管理','0102040000','系统管理',NULL),(23,1,'系统管理','0102010100','用户基本信息管理',NULL),(24,1,'系统管理','0102010101','新增用户',NULL),(25,1,'系统管理','0102010102','修改用户',NULL),(26,1,'系统管理','0102010103','删除用户',NULL),(27,1,'系统管理','0102010200','用户组管理',NULL),(28,1,'系统管理','0102010201','新增用户组',NULL),(29,1,'系统管理','0102010202','修改用户组',NULL),(30,1,'系统管理','0102010203','删除用户组',NULL),(31,1,'系统管理','01020100300','修改密码',NULL),(32,1,'系统管理','0102020100','图书馆基本信息管理','/page/librarymgmt.jsp'),(33,1,'系统管理','0102020101','新增图书馆基本信息',NULL),(34,1,'系统管理','0102020102','修改图书馆基本信息',NULL),(35,1,'系统管理','0102020103','删除图书馆基本信息',NULL),(36,1,'系统管理','0102020200','图书馆服务模板管理','/page/libraryconfig.jsp'),(37,1,'系统管理','0102020201','新增图书馆模板',NULL),(38,1,'系统管理','0102020202','修改图书馆模板',NULL),(39,1,'系统管理','0102020203','删除图书馆模板',NULL),(40,1,'系统管理','0102020300','密码模板管理',NULL),(41,1,'系统管理','0102020301','新增密码模板',NULL),(42,1,'系统管理','0102020302','修改密码模板',NULL),(43,1,'系统管理','0102020303','删除密码模板',NULL),(44,1,'系统管理','0102030100','ACS协议配置模板',NULL),(45,1,'系统管理','0102030101','新增ACS协议配置模板',NULL),(46,1,'系统管理','0102030102','修改ACS协议配置模板',NULL),(47,1,'系统管理','0102030103','删除ACS协议配置模板',NULL),(48,1,'系统管理','0102030200','读者流通类型管理','/page/system-readertype.jsp'),(49,1,'系统管理','0102030201','新增流通类型',NULL),(50,1,'系统管理','0102030202','修改流通类型',NULL),(51,1,'系统管理','0102030203','删除流通类型',NULL),(52,1,'系统管理','0102030300','数据查询模板',NULL),(53,1,'系统管理','0102030301','新增数据查询模板',NULL),(54,1,'系统管理','0102030302','修改数据查询模板',NULL),(55,1,'系统管理','0102030303','删除数据查询模板',NULL),(56,1,'系统管理','0102030400','统计模板',NULL),(57,1,'系统管理','0102030401','新增统计模板',NULL),(58,1,'系统管理','0102030402','修改统计模板',NULL),(59,1,'系统管理','0102030403','删除统计模板',NULL),(60,1,'系统管理','0102030500','设备基本信息管理','/page/devicemgmt.jsp'),(61,1,'系统管理','0102030501','新增设备',NULL),(62,1,'系统管理','0102030502','修改设备','/page/deviceedit.jsp'),(63,1,'系统管理','0102030503','删除设备',NULL),(64,1,'系统管理','0102030600','设备组管理','/page/devicegroup.jsp'),(65,1,'系统管理','0102030601','新增设备组',NULL),(66,1,'系统管理','0102030602','修改设备组',NULL),(67,1,'系统管理','0102030603','删除设备组',NULL),(68,1,'系统管理','0102030700','亮灯模板',NULL),(69,1,'系统管理','0102030800','硬件与逻辑名配置模板',NULL),(70,1,'系统管理','0102030900','运行配置模板',NULL),(71,1,'系统管理','0102031000','数据同步配置模板','page/devmgmt/databasesync_config.jsp'),(72,1,'系统管理','0102030701','新增亮灯模板',NULL),(73,1,'系统管理','0102030702','修改亮灯模板',NULL),(74,1,'系统管理','0102030703','删除亮灯模板',NULL),(75,1,'系统管理','0102030801','新增硬件与逻辑名配置',NULL),(76,1,'系统管理','0102030802','修改硬件与逻辑名配置',NULL),(77,1,'系统管理','0102030803','删除硬件与逻辑名配置',NULL),(78,1,'系统管理','0102030901','新增运行日志配置',NULL),(79,1,'系统管理','0102030902','修改运行日志配置',NULL),(80,1,'系统管理','0102030903','删除运行日志配置',NULL),(81,1,'系统管理','0102031001','新增数据同步配置',NULL),(82,1,'系统管理','0102031002','修改数据同步配置',NULL),(83,1,'系统管理','0102031003','删除数据同步配置',NULL),(84,1,'系统管理','0102031100','设备服务管理',NULL),(85,1,'系统管理','0102031101','新增设备服务列表',NULL),(86,1,'系统管理','0102031102','修改设备服务列表',NULL),(87,1,'系统管理','0102031103','删除设备服务列表',NULL),(88,1,'系统管理','0102031200','设备类型管理','/page/devmgmt/devicetype.jsp'),(89,1,'系统管理','0102031201','新增设备类型',''),(90,1,'系统管理','0102031202','修改设备类型',NULL),(91,1,'系统管理','0102031203','删除设备类型',NULL),(92,1,'系统管理','0102040100','系统日志查询与导出',NULL),(93,1,'系统管理','0102040101','系统日志查询',NULL),(94,1,'系统管理','0102040102','系统日志导出',NULL),(95,1,'系统管理','0102040200','数据库备份',NULL),(96,1,'系统管理','0102040201','mysql库备份',NULL),(97,1,'系统管理','0102040202','MongoDB库备份',NULL),(98,2,'设备端操作','00010001','acs登录',NULL),(99,2,'设备端操作','00010002','acs登出',NULL),(100,2,'设备端操作','00010101','借书',NULL),(101,2,'设备端操作','00010102','还书',NULL),(102,2,'设备端操作','00010103','续借',NULL),(103,2,'设备端操作','00010104','预借',NULL),(104,2,'设备端操作','00010201','办证有卡',NULL),(105,2,'设备端操作','00010202','办证无卡',NULL),(106,2,'设备端操作','00010301','收款',NULL),(107,2,'设备端操作','00010302','划账支出',NULL),(108,2,'设备端操作','00010303','ACS扣缴',NULL),(109,2,'设备端操作','00010304','一卡通扣缴',NULL),(110,2,'设备端操作','00030101','图书上架',NULL),(111,2,'设备端操作','00030102','图书下架',NULL),(112,2,'设备端操作','00030201','图书入箱',NULL),(113,2,'设备端操作','00030202','图书出箱',NULL),(114,2,'设备端操作','00030301','卡入箱',NULL),(115,2,'设备端操作','00030302','卡出箱',NULL),(116,2,'设备端操作','00030401','钱入箱',NULL),(117,2,'设备端操作','00030402','钱出箱',NULL),(118,1,'系统管理','0102040300','数据库还原',NULL),(119,1,'系统管理','0102040301','mysql库还原',NULL),(120,1,'系统管理','0102040302','MongoDB库备份',NULL),(121,1,'节点管理','0105000000','节点管理',NULL),(122,1,'节点管理','0105010000','节点管理',NULL),(123,1,'节点管理','0105020000','节点类型管理',NULL),(124,1,'节点管理','0105030000','容器管理',NULL),(125,1,'节点管理','0105040000','云主机管理',NULL),(126,1,'节点监控','0106000000','节点监控',NULL),(127,1,'节点监控','0106010000','节点监控',NULL),(128,1,'系统管理','0102032000','设备显示风格','/page/devmgmt/devicedisplay.jsp'),(129,1,'系统管理','0102032001','新增设备显示风格',NULL),(130,1,'系统管理','0102032002','修改设备显示风格',NULL),(131,1,'系统管理','0102032003','删除设备显示风格',NULL);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
