/*
SQLyog Ultimate v12.09 (64 bit)
MySQL - 5.6.21-log : Database - ssitcloud_authentication
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`ssitcloud_authentication` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `ssitcloud_authentication`;

/*Table structure for table `log_message` */

DROP TABLE IF EXISTS `log_message`;

CREATE TABLE `log_message` (
  `log_idx` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `log_code` varchar(6) NOT NULL COMMENT '消息代码',
  `log_desc` varchar(50) NOT NULL COMMENT '消息说明',
  `log_mark` varchar(200) DEFAULT NULL COMMENT '数据参数说明',
  PRIMARY KEY (`log_idx`),
  KEY `log_code` (`log_code`)
) ENGINE=InnoDB AUTO_INCREMENT=5203 DEFAULT CHARSET=utf8;

/*Data for the table `log_message` */

insert  into `log_message`(`log_idx`,`log_code`,`log_desc`,`log_mark`) values (2,'5002','用户退出系统','馆ID｜用户ID｜用户名｜'),(3,'1101','设备注册','监控模板ID｜设备模板ID｜运行模板ID｜数据同步模板ID'),(4,'2110','监控管理','馆IDX｜维护指令｜设备ID组'),(5,'3101','新增用户','馆IDX｜用户IDX｜用户名｜'),(6,'3102','修改用户','馆IDX｜用户IDX｜用户名｜'),(7,'3103','删除用户','馆IDX｜用户IDX｜用户名｜'),(10,'3201','新加用户组','馆IDX｜用户组IDX｜用户组名｜'),(11,'3202','修改用户组信息','馆IDX｜用户组IDX｜用户组名｜'),(12,'3203','删除用户组信息','馆IDX｜用户组IDX｜用户组名｜'),(13,'3301','修改密码','馆IDX｜用户IDX｜用户名｜'),(15,'4101','新增图书馆信息','馆IDX｜馆名'),(16,'4102','修改图书馆信息','馆IDX｜馆名'),(17,'4103','删除图书馆信息','馆IDX｜馆名'),(18,'4201','新增读者流通类型','馆IDX｜流通类型IDX｜流通类型名'),(19,'4202','修改读者流通类型','馆IDX｜流通类型IDX｜流通类型名'),(20,'4203','删除读者流通类型','馆IDX｜流通类型IDX｜流通类型名'),(21,'4301','新增自助借还协议模板','馆IDX｜协议IDX｜协议内容'),(22,'4302','修改自助借还协议模板','馆IDX｜协议IDX｜协议内容'),(23,'4303','删除自助借还协议模板','馆IDX｜协议IDX｜协议内容'),(24,'4401','新增图书馆服务模板','馆IDX｜服务模板IDX｜服务模板名'),(25,'4402','修改图书馆服务模板','馆IDX｜服务模板IDX｜服务模板名'),(26,'4403','删除图书馆服务模板','馆IDX｜服务模板IDX｜服务模板名'),(27,'4501','新增数据库同步模板配置','馆IDX｜同步模板IDX｜同步模板名'),(28,'4502','修改数据库同步模板配置','馆IDX｜同步模板IDX｜同步模板名'),(29,'4503','删除数据库同步模板配置','馆IDX｜同步模板IDX｜同步模板名'),(30,'4601','新增数据查询模板','馆IDX｜查询模板IDX｜查询模板名'),(31,'4602','修改数据查询模板','馆IDX｜查询模板IDX｜查询模板名'),(32,'4603','删除数据查询模板','馆IDX｜查询模板IDX｜查询模板名'),(33,'4701','新增密码模板','馆IDX｜密码模板IDX｜密码模板名'),(34,'4702','修改密码模板','馆IDX｜密码模板IDX｜密码模板名'),(35,'4703','删除密码模板','馆IDX｜密码模板IDX｜密码模板名'),(36,'4801','新增统计模板','馆IDX｜统计模板IDX｜统计模板名'),(37,'4802','修改统计模板','馆IDX｜统计模板IDX｜统计模板名'),(38,'4803','删除统计模板','馆IDX｜统计模板IDX｜统计模板名'),(39,'5101','新增设备基本信息','馆IDX｜设备IDX｜设备名'),(40,'5102','修改设备基本信息','馆IDX｜设备IDX｜设备名'),(41,'5103','删除设备基本信息','馆IDX｜设备IDX｜设备名'),(42,'5201','新增设备组信息','馆IDX｜设备组IDX｜设备组名'),(43,'5202','修改设备组信息','馆IDX｜设备组IDX｜设备组名'),(44,'5203','删除设备组信息','馆IDX｜设备组IDX｜设备组名'),(45,'5311','新增硬件与逻辑名配置模板','硬件与逻辑名配置模板IDX｜硬件与逻辑名配置模板名'),(46,'5312','修改硬件与逻辑名配置模板','硬件与逻辑名配置模板IDX｜硬件与逻辑名配置模板名'),(47,'5313','删除硬件与逻辑名配置模板','硬件与逻辑名配置模板IDX｜硬件与逻辑名配置模板名'),(48,'5321','新增亮灯模板配置','亮灯模板IDX｜亮灯模板名'),(49,'5322','修改亮灯模板配置','亮灯模板IDX｜亮灯模板名'),(50,'5323','删除亮灯模板配置','亮灯模板IDX｜亮灯模板名'),(51,'5331','新增运行日志配置','运行日志模板IDX｜运行日志模板名'),(52,'5332','修改运行日志配置','运行日志模板IDX｜运行日志模板名'),(53,'5333','删除运行日志配置','运行日志模板IDX｜运行日志模板名'),(54,'5341','新增同步数据配置','同步数据配置IDX｜同步数据配置名'),(55,'5342','修改同步数据配置','同步数据配置IDX｜同步数据配置名'),(56,'5343','删除同步数据配置','同步数据配置IDX｜同步数据配置名'),(57,'5401','新增设备服务管理逻辑','馆IDX｜设备组IDX｜服务组IDX｜设备服务管理名'),(58,'5402','修改设备服务管理逻辑','馆IDX｜设备组IDX｜服务组IDX｜设备服务管理名'),(59,'5403','删除设备服务管理逻辑','馆IDX｜设备组IDX｜服务组IDX｜设备服务管理名'),(60,'6100','系统日志查询与导出','馆IDX｜库类型｜｜'),(61,'6200','数据库备份','馆IDX｜库类型｜｜'),(62,'5501','新增设备类型','IDX|名称'),(63,'5502','修改设备类型','IDX|名称'),(64,'5503','删除设备类型','IDX'),(65,'3401','新增权限分组','IDX|分组名'),(66,'3402','修改权限分组','IDX|分组名'),(67,'3403','删除权限分组','IDX'),(5201,'5001','登录验证','失败次数|||'),(5202,'6300','数据库还原','馆IDX｜库类型｜｜');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
